## 🧾 Terraform Plan for `iam_policy`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam_policy_basic.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Grants read-only access to S3"
      + id          = (known after apply)
      + name        = "basic-readonly-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "dev"
          + "Owner"       = "example-team"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "Owner"       = "example-team"
        }
    }

  # module.iam_policy_basic.aws_iam_policy_attachment.this[0] will be created
  + resource "aws_iam_policy_attachment" "this" {
      + id         = (known after apply)
      + name       = "basic-readonly-policy-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "readonly-role",
        ]
    }

  # module.iam_policy_irsa.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Allows EKS pods to access S3 via IRSA"
      + id          = (known after apply)
      + name        = "eks-irsa-s3-reader"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::my-app-bucket",
                          + "arn:aws:s3:::my-app-bucket/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App"         = "eks-service"
          + "Environment" = "staging"
        }
      + tags_all    = {
          + "App"         = "eks-service"
          + "Environment" = "staging"
        }
    }

  # module.iam_policy_irsa.aws_iam_policy_attachment.this[0] will be created
  + resource "aws_iam_policy_attachment" "this" {
      + id         = (known after apply)
      + name       = "eks-irsa-s3-reader-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "eks-irsa-role",
        ]
    }

  # module.iam_policy_sso_managed.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Attaches AWS managed policies to an SSO permission set"
      + id          = (known after apply)
      + name        = "sso-managed-access"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy_id   = (known after apply)
      + tags        = {
          + "Department"  = "Engineering"
          + "Environment" = "prod"
        }
      + tags_all    = {
          + "Department"  = "Engineering"
          + "Environment" = "prod"
        }
    }

  # module.iam_policy_sso_managed.aws_ssoadmin_managed_policy_attachment.this["0"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "this" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-EXAMPLE1234"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/AmazonEC2ReadOnlyAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = "arn:aws:sso:::permissionSet/ssoins-EXAMPLE1234/ps-EXAMPLE5678"
    }

  # module.iam_policy_sso_managed.aws_ssoadmin_managed_policy_attachment.this["1"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "this" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-EXAMPLE1234"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/CloudWatchReadOnlyAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = "arn:aws:sso:::permissionSet/ssoins-EXAMPLE1234/ps-EXAMPLE5678"
    }

  # module.iam_policy_sso_managed.aws_ssoadmin_permission_set_inline_policy.this[0] will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "this" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode({})
      + instance_arn       = "arn:aws:sso:::instance/ssoins-EXAMPLE1234"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-EXAMPLE1234/ps-EXAMPLE5678"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->